# <p style="color:black"> EDA OF MOVIE RAW DATA

<figure>
    <img src="movie header.jpg"
         alt="Movie Studio"
         width="400"
         height="200">
    <figcaption><center><bold>Microsoft's new movie studio!</figcaption>
</figure>

The purpose of this notebook is to perform exploratory data anlysis of the movie studio information that was provided to our group for the Phase 1 Project. When looking at the data, it can be broken up into two types:

1. An extract from IMDB, which is presented in a .db database file, and
2. Various CSV style files from different movie analysis websites.

This notebook's analysis will be structured as such:

- Analysis of the database file
- Analysis of the high priority CSV files (mainly, `bom.movie_gross.csv.gz`)
- Analysis of the remaining CSV files
- Preliminary thoughts on combination of files, and
- Preliminary thoughts on the group project story

# <p style="color:black"> DATABASE SECTION

## <p style="color:black"> Database - Short summary of findings

In short, the database information gives a lot of color and background to each of the movie_id's. From the movie_id, we can determine genre, geography, language, and the people who are involved in the film through use of SQL combination scripts.

This database will likely become relevant once we are able to put more numbers and analysis to the performance of the movies, which will likely come from the csv files.

See the section on the CSV files for more analysis

## <p style="color:black"> Analysis of the database file

To begin, we will import the SQL lite database package and import the database

In [1]:
import sqlite3
import pandas as pd
conn = sqlite3.connect("Raw Data/im.db/im.db")
cur = conn.cursor()

Let's take a look at the names of all the tables, and compare it to the schema that was presented in the intro materials:

In [2]:
df = pd.read_sql("""
SELECT name as table_name
FROM sqlite_master
WHERE type = 'table';
""", conn)
df

      table_name
0   movie_basics
1      directors
2      known_for
3     movie_akas
4  movie_ratings
5        persons
6     principals
7        writers

<figure>
    <img src="movie_data_erd.jpeg"
         alt="Database Schema"
         width="600"
         height="300">
    <figcaption><center><bold>It is clear from analyzing the tables that the schema jpg is accurate and the database is loaded</figcaption>
</figure>

### <p style="color:black"> Table: Persons

In [3]:
df_persons = pd.read_sql("""
SELECT *
FROM persons
""", conn)
df_persons.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 606648 entries, 0 to 606647
Data columns (total 5 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   person_id           606648 non-null  object
 1   primary_name        606648 non-null  object
 2   birth_year          82736 non-null   float64
 3   death_year          6783 non-null    float64
 4   primary_profession  555308 non-null  object
dtypes: float64(2), object(3)
memory usage: 23.1+ MB

In [4]:
df_persons.head(2)

,person_id,primary_name,birth_year,death_year,primary_profession
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department"

Conclusion:
- The primary key of this data is likely person_id
- This table looks like a mostly complete list of persons, names, and their professions
- Primary professions has an embedded list of data inside of it
- The most useful columns for this are likely person_id and primary_profession, as they will link certain tables together

### <p style="color:black"> Table: Principals

In [5]:
df_principals = pd.read_sql("""
SELECT *
FROM principals
""", conn)
df_principals.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1028186 entries, 0 to 1028185
Data columns (total 6 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   movie_id    1028186 non-null  object
 1   ordering    1028186 non-null  int64
 2   person_id   1028186 non-null  object
 3   category    1028186 non-null  object
 4   job         177684 non-null   object
 5   characters  393360 non-null   object
dtypes: int64(1), object(5)
memory usage: 47.1+ MB

In [6]:
df_principals.tail(5)

,movie_id,ordering,person_id,category,job,characters
1028181,tt9692684,1,nm0186469,actor,None,"[""Ebenezer Scrooge""]"
1028182,tt9692684,2,nm4929530,self,None,"[""Herself"",""Regan""]"
1028183,tt9692684,3,nm10441594,director,None,None
1028184,tt9692684,4,nm6009913,writer,writer,None
1028185,tt9692684,5,nm10441595,producer,producer,None

Conclusion:
- The primary key of this table appears to be person_id
- This table goes into detail on which person is related to which movie
- Characters is a list of all relevant characters for an actor
- The most useful columns for this are likely person_id, category, and movie_id, as they could provide links for data attributes

### <p style="color:black"> Table: Known For, Directors, and Writers

Note: These tables appear similar in nature in that they are connector tables or subsets of the Principals table. This section will explore how/if these tables can be combined

In [7]:
df_principals = pd.read_sql("""
SELECT *
FROM known_for
""", conn)
df_principals.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1638260 entries, 0 to 1638259
Data columns (total 2 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   person_id  1638260 non-null  object
 1   movie_id   1638260 non-null  object
dtypes: object(2)
memory usage: 25.0+ MB

In [8]:
df_principals.head(2)

   person_id   movie_id
0  nm0061671  tt0837562
1  nm0061671  tt2398241

In [9]:
df_directors = pd.read_sql("""
SELECT *
FROM directors
""", conn)
df_principals.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1638260 entries, 0 to 1638259
Data columns (total 2 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   person_id  1638260 non-null  object
 1   movie_id   1638260 non-null  object
dtypes: object(2)
memory usage: 25.0+ MB

In [10]:
df_directors.head(2)

    movie_id  person_id
0  tt0285252  nm0899854
1  tt0462036  nm1940585

In [11]:
df_writers = pd.read_sql("""
SELECT *
FROM writers
""", conn)
df_writers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 255873 entries, 0 to 255872
Data columns (total 2 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   movie_id   255873 non-null  object
 1   person_id  255873 non-null  object
dtypes: object(2)
memory usage: 3.9+ MB

In [12]:
df_writers.head(2)

    movie_id  person_id
0  tt0285252  nm0899854
1  tt0438973  nm0175726

Conclusion:
- All tables contain movie_id and person_id fields and are complete
- Principals and directors tables have the same numer of records (1.6m), Writers has about a fourth of that
- It is not immediately clear the benefit of combining these together, however when we formulate our hypothesis, perhaps it will become more evident of the value of linking movies and their associated people (writers, directors, etc)

### <p style="color:black"> Table: Movie Basics

In [13]:
df_movie_basics = pd.read_sql("""
SELECT *
FROM movie_basics
""", conn)
df_movie_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   movie_id         146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

In [14]:
df_movie_basics.head(2)

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"

Conclusion:
- Seems like a solid index for basic movie information
- Primary key is likely 'movie_id'
- Genres contains a list of genres
- Mostly complete except for runtime and genres, which look about 90% complete

### <p style="color:black"> Table: Movie Ratings

In [15]:
df_movie_ratings = pd.read_sql("""
SELECT *
FROM movie_ratings
""", conn)
df_movie_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   movie_id       73856 non-null  object
 1   averagerating  73856 non-null  float64
 2   numvotes       73856 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

In [16]:
df_movie_ratings.head(2)

     movie_id  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559

Conclusion:
- Contains rating information by movie ID
- Data set appears complete
- Could be useful for understanding a movie's reception vs it's revenue

### <p style="color:black"> Table: Movie AKA's

In [17]:
df_movie_akas = pd.read_sql("""
SELECT *
FROM movie_akas
""", conn)
df_movie_akas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 331703 entries, 0 to 331702
Data columns (total 8 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   movie_id           331703 non-null  object
 1   ordering           331703 non-null  int64
 2   title              331703 non-null  object
 3   region             278410 non-null  object
 4   language           41715 non-null   object
 5   types              168447 non-null  object
 6   attributes         14925 non-null   object
 7   is_original_title  331678 non-null  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 20.2+ MB

In [18]:
df_movie_akas.tail(15)

,movie_id,ordering,title,region,language,types,attributes,is_original_title
331688,tt9705860,3,Dusan Vukotic hrvatski okarovac,HR,None,None,None,0.0
331689,tt9723084,1,Anderswo. Allein in Afrika,DE,None,imdbDisplay,None,0.0
331690,tt9723084,2,Anderswo. Allein in Afrika,None,None,original,None,1.0
331691,tt9726638,1,Qi Tian Da Sheng 2,CN,yue,imdbDisplay,None,0.0
331692,tt9726638,2,Monkey King: The Volcano,None,None,original,None,1.0
331693,tt9726638,3,Qi Tian Da Sheng Huo Yan Shan,CN,yue,imdbDisplay,None,0.0
331694,tt9755806,1,Big Shark,US,None,None,None,0.0
331695,tt9755806,2,Большая Акула,RU,None,None,None,0.0
331696,tt9755806,3,Big Shark,None,None,original,None,1.0
331697,tt9827784,1,Sayonara kuchibiru,JP,None,None,None,0.0
331698,tt9827784,2,Sayonara kuchibiru,None,None,original,None,1.0
331699,tt9827784,3,Farewell Song,XWW,en,imdbDisplay,None,0.0
331700,tt9880178,1,La atención,None,None,original,None,1.0
331701,tt9880178,2,La atención,ES,None,None,None,0.0
331702,tt9880178,3,The Attention,XWW,en,imdbDisplay,None,0.0

Conclusion:
- Could be useful for understanding the region and language a particular movie was distributed in
- Mostly complete, but contains a lot of missing values in the language, attributes, and types fields

# <p style="color:black"> CSV SECTION

## <p style="color:black"> Short Summary of CSV Files

The CSV files will take some work to combine, but at the end of the day, they will contain important pieces of information we can use for our story. In my mind, the following data points are important and we can get them from the following (files)

For each movie:
- The movie ID (tn.movie_budgets.csv.gz)
- The title (movie_budgets.csv.gz)
- The studio (bom.movie_gross.csv.gz)
- The domestic gross (bom.movie_gross.csv.gz -or- movie_budgets.csv.gz)
- The international gross (bom.movie_gross.csv.gz -or- movie_budgets.csv.gz)
- The year it came out (bom.movie_gross.csv.gz)
- The genre (movie_info.tsv.gz)
- The director (movie_info.tsv.gz)
- The writer (rt.movie_info.tsv.gz)

For each studio:
- Movies published by that studio (bom.movie_gross.csv.gz)
- Domestic and international gross of that studio over time (rt.movie_info.tsv.gz)
 - Maybe we can throw in what kind of genres each studio excel in

## <p style="color:black"> Analysis of CSV files

The CSV files are made up of the five files
- Bom.Movie_gross.csv.gz
- rt.movie_info_tsv.gz
- rt.reviews.tsv.gz
- tmdb.movies.csv.gz
- tn.movie_budgets.csv.gz

## <p style="color:black"> CSV File: bom.movie_gross.csv.gz

In [19]:
df_movie_gross = pd.read_csv("Raw Data/bom.movie_gross.csv.gz")
import seaborn as sns
import matplotlib.pyplot as plt

In [20]:
df_movie_gross.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [21]:
df_movie_gross.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [22]:
df_movie_gross.pivot_table(index='studio', columns='year', values='domestic_gross', aggfunc='sum')

year,2010,2011,2012,2013,2014,2015,2016,2017,2018
studio,,,,,,,,,
3D,6100000.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
A23,NaN,151000.0,NaN,13200.0,NaN,NaN,NaN,NaN,NaN
A24,NaN,NaN,NaN,27845400.0,18988300.0,59675100.0,76431700.0,95405700.0,45848000.0
ADC,NaN,NaN,NaN,NaN,NaN,228000.0,NaN,20200.0,NaN
AF,NaN,NaN,1155000.0,76900.0,558000.0,353000.0,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...
XL,NaN,NaN,NaN,117000.0,341000.0,NaN,NaN,NaN,NaN
YFG,NaN,NaN,NaN,NaN,NaN,NaN,1100000.0,NaN,NaN
Yash,43800.0,496000.0,5352600.0,8000000.0,NaN,2379000.0,8500000.0,6530000.0,330000.0
Zee,NaN,NaN,NaN,NaN,NaN,NaN,1100000.0,NaN,NaN
Zeit.,1398000.0,1571200.0,550000.0,785000.0,504700.0,22900.0,11700.0,820000.0,NaN

Conclusion:
- This will be a very important data set, as it contains the domestic and foreign gross for each movie
- This data is not complete, and does not have a movie_id for movies which could link it back to the IMDB movie database
- Additionally, we do not know what currency the foreign currency is denominated in

## <p style="color:black"> CSV File: rt.movie_info.tsv.gz

In [23]:
df_movie_info = pd.read_csv("Raw Data/rt.movie_info.tsv.gz", sep='\t')

In [24]:
df_movie_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1560 entries, 0 to 1559
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            1560 non-null   int64
 1   synopsis      1498 non-null   object
 2   rating        1557 non-null   object
 3   genre         1552 non-null   object
 4   director      1361 non-null   object
 5   writer        1111 non-null   object
 6   theater_date  1201 non-null   object
 7   dvd_date      1201 non-null   object
 8   currency      340 non-null    object
 9   box_office    340 non-null    object
 10  runtime       1530 non-null   object
 11  studio        494 non-null    object
dtypes: int64(1), object(11)
memory usage: 146.4+ KB

In [25]:
df_movie_info.head()

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One
2,5,Illeana Douglas delivers a superb performance ...,R,Drama|Musical and Performing Arts,Allison Anders,Allison Anders,"Sep 13, 1996","Apr 18, 2000",NaN,NaN,116 minutes,NaN
3,6,Michael Douglas runs afoul of a treacherous su...,R,Drama|Mystery and Suspense,Barry Levinson,Paul Attanasio|Michael Crichton,"Dec 9, 1994","Aug 27, 1997",NaN,NaN,128 minutes,NaN
4,7,NaN,NR,Drama|Romance,Rodney Bennett,Giles Cooper,NaN,NaN,NaN,NaN,200 minutes,NaN

Conclusion:
- Man, this data sucks
- There is no movie title! More likely, we will need to pull together the director, year, and studio of each of these in order to link it to other data tables
- Unclear what kind of value add information this creates for our hypothesis

## <p style="color:black"> CSV File: rt.reviews.tsv.gz

In [26]:
df_movie_reviews = pd.read_csv("Raw Data/rt.reviews.tsv.gz", sep='\t', encoding='latin1')

In [27]:
df_movie_reviews.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54432 entries, 0 to 54431
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          54432 non-null  int64
 1   review      48869 non-null  object
 2   rating      40915 non-null  object
 3   fresh       54432 non-null  object
 4   critic      51710 non-null  object
 5   top_critic  54432 non-null  int64
 6   publisher   54123 non-null  object
 7   date        54432 non-null  object
dtypes: int64(2), object(6)
memory usage: 3.3+ MB

In [28]:
df_movie_reviews.tail()

,id,review,rating,fresh,critic,top_critic,publisher,date
54427,2000,The real charm of this trifle is the deadpan c...,NaN,fresh,Laura Sinagra,1,Village Voice,"September 24, 2002"
54428,2000,NaN,1/5,rotten,Michael Szymanski,0,Zap2it.com,"September 21, 2005"
54429,2000,NaN,2/5,rotten,Emanuel Levy,0,EmanuelLevy.Com,"July 17, 2005"
54430,2000,NaN,2.5/5,rotten,Christopher Null,0,Filmcritic.com,"September 7, 2003"
54431,2000,NaN,3/5,fresh,Nicolas Lacroix,0,Showbizz.net,"November 12, 2002"

Conclusion:
- Again, this data is pretty rough. There isn't a good way to identify what the movie title is, nor what studio it is affiliated with.
- It does give a rating for each movie, but identifying what movie it related to will be tough

## <p style="color:black"> CSV File: tmdb.movies.csv.gz

In [29]:
df_movie_db2 = pd.read_csv("Raw Data/tmdb.movies.csv.gz")

In [30]:
df_movie_db2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26517 entries, 0 to 26516
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         26517 non-null  int64
 1   genre_ids          26517 non-null  object
 2   id                 26517 non-null  int64
 3   original_language  26517 non-null  object
 4   original_title     26517 non-null  object
 5   popularity         26517 non-null  float64
 6   release_date       26517 non-null  object
 7   title              26517 non-null  object
 8   vote_average       26517 non-null  float64
 9   vote_count         26517 non-null  int64
dtypes: float64(2), int64(3), object(5)
memory usage: 2.0+ MB

In [31]:
df_movie_db2.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

Conclusion:
- Complete list of data for movies. Has some type of ID, but unclear what kind of ID this is
- Contains popularity data, likely some kind of user generated reviews, possibily?

## <p style="color:black"> CSV File: tn.movie_budgets.csv.gz

In [32]:
df_budgets = pd.read_csv("Raw Data/tn.movie_budgets.csv.gz")

In [38]:
df_budgets['id'].value_counts()

4      58
53     58
61     58
65     58
69     58
       ..
85     57
100    57
96     57
92     57
97     57
Name: id, Length: 100, dtype: int64

In [41]:
df_budgets.loc[df_budgets['id'] == 65]

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
64,65,"Jun 9, 2017",The Mummy,"$195,000,000","$80,101,125","$409,953,905"
164,65,"Jun 29, 2007",Ratatouille,"$150,000,000","$206,445,654","$626,549,695"
264,65,"May 19, 2006",The Da Vinci Code,"$125,000,000","$217,536,138","$767,820,459"
364,65,"Jul 2, 1991",Terminator 2: Judgment Day,"$100,000,000","$203,464,105","$515,419,827"
464,65,"Jul 25, 2003",Lara Croft: Tomb Raider: The Cradle of Life,"$90,000,000","$65,653,758","$157,092,943"
564,65,"Nov 26, 1997",Flubber,"$80,000,000","$92,993,801","$177,993,801"
664,65,"Jun 13, 2003",Hollywood Homicide,"$75,000,000","$30,207,785","$50,409,753"
764,65,"Jun 22, 2012",Abraham Lincoln: Vampire Hunter,"$67,500,000","$37,519,139","$137,489,730"
864,65,"Jun 27, 1990",Days of Thunder,"$60,000,000","$82,670,733","$157,670,733"
964,65,"Apr 4, 2008",Leatherheads,"$58,000,000","$31,373,938","$41,348,628"
1064,65,"Oct 16, 1998",Beloved,"$53,000,000","$22,852,487","$22,852,487"
1164,65,"Jan 16, 2009",Defiance,"$50,000,000","$28,644,813","$52,987,754"
1264,65,"Jun 5, 1992",Patriot Games,"$45,000,000","$83,287,363","$178,100,000"
1364,65,"Dec 3, 2010",The Warrior's Way,"$42,000,000","$5,666,340","$8,514,325"
1464,65,"Aug 20, 1999",Mickey Blue Eyes,"$40,000,000","$33,864,342","$53,864,342"
1564,65,"Dec 29, 1999",The Hurricane,"$38,000,000","$50,699,241","$73,956,241"
1664,65,"Jan 23, 2009",Underworld 3: Rise of the Lycans,"$35,000,000","$45,802,315","$89,102,315"
1764,65,"Sep 1, 1999",Chill Factor,"$34,000,000","$11,263,966","$11,263,966"
1864,65,"Aug 18, 2017",The Hitmanâs Bodyguard,"$30,000,000","$75,468,583","$172,778,667"
1964,65,"Apr 9, 2004",The Whole Ten Yards,"$30,000,000","$16,323,969","$26,323,969"
2064,65,"Aug 16, 2013",Kick-Ass 2,"$28,000,000","$28,795,985","$63,129,909"
2164,65,"Dec 12, 2008",Gran Torino,"$25,000,000","$148,095,302","$274,543,085"
2264,65,"Sep 30, 2005",The Greatest Game Ever Played,"$25,000,000","$15,331,289","$15,468,266"
2364,65,"Jun 10, 2005",The Bridge of San Luis Rey,"$24,000,000","$49,981","$1,696,765"
2464,65,"Mar 19, 1993",Teenage Mutant Ninja Turtles III,"$21,000,000","$42,273,609","$42,273,609"
2564,65,"Aug 31, 2011",The Debt,"$20,000,000","$31,177,548","$46,604,054"
2664,65,"Apr 24, 2015",Little Boy,"$20,000,000","$6,485,961","$17,769,299"
2764,65,"Nov 3, 2006",Borat,"$18,000,000","$128,505,958","$261,443,242"
2864,65,"Dec 31, 2007",Taxi 4,"$17,500,000",$0,"$60,865,364"
2964,65,"Nov 18, 2016",Bleed for This,"$16,000,000","$5,083,906","$6,603,926"
3064,65,"Jan 15, 1993",Nowhere to Run,"$15,000,000","$22,189,039","$52,189,039"
3164,65,"Feb 12, 1993",Groundhog Day,"$14,600,000","$70,906,973","$70,906,973"
3264,65,"Feb 5, 1993",Loaded Weapon 1,"$13,000,000","$27,979,399","$27,979,399"
3364,65,"Nov 22, 2013",Philomena,"$12,000,000","$37,709,979","$98,963,392"
3464,65,"May 25, 1977",Star Wars Ep. IV: A New Hope,"$11,000,000","$460,998,007","$786,598,007"
3564,65,"Feb 16, 2001",Recess: School's Out,"$10,000,000","$36,696,761","$44,451,470"
3664,65,"Mar 16, 2012","Jeff, Who Lives at Home","$10,000,000","$4,269,426","$4,708,127"
3764,65,"Dec 29, 1995",Richard III,"$9,200,000","$2,684,904","$4,199,334"
3864,65,"Mar 9, 1984",Splash,"$8,000,000","$62,599,495","$62,599,495"
3964,65,"Feb 22, 2008",Witless Protection,"$7,500,000","$4,151,836","$4,151,836"
4064,65,"Dec 31, 2015",Geroy,"$7,000,000",$0,"$1,545,121"
4164,65,"Jul 20, 2001",Hedwig and the Angry Inch,"$6,000,000","$3,067,312","$3,740,030"
4264,65,"May 16, 1975",The Return of the Pink Panther,"$5,000,000","$41,833,347","$41,833,347"
4364,65,"Jan 17, 1997",Albino Alligator,"$5,000,000","$353,480","$353,480"
4464,65,"Jun 6, 2003",Whale Rider,"$4,300,000","$20,779,666","$39,374,600"
4564,65,"Jul 11, 2014",The Perfect Wave,"$4,000,000",$0,$0
4664,65,"Oct 20, 2010",Paranormal Activity 2,"$3,000,000","$84,752,907","$177,512,032"
4764,65,"Dec 31, 2015",AWOL-72,"$3,000,000",$0,$0
4864,65,"Apr 15, 2015",The Toxic Avenger Part II,"$2,300,000",$0,$0
4964,65,"Jan 1, 1993",Return of the Living Dead 3,"$2,000,000","$21,000","$21,000"
5064,65,"Sep 12, 2003",Cabin Fever,"$1,500,000","$21,158,188","$30,351,664"
5164,65,"Sep 18, 1951",The Day the Earth Stood Still,"$1,200,000","$3,700,000","$3,700,000"
5264,65,"Jun 20, 1997",Dream With The Fishes,"$1,000,000","$542,909","$542,909"
5364,65,"Mar 10, 2000",Deterrence,"$800,000","$144,583","$371,647"
5464,65,"Sep 10, 2014",Born to Fly: Elizabeth Streb vs. Gravity,"$500,000","$1,822","$1,822"
5564,65,"Dec 31, 2010",Anderson's Cross,"$300,000",$0,$0
5664,65,"Dec 31, 2015",Escaping the Holocost,"$150,000",$0,$0
5764,65,"Dec 31, 2007",Tin Can Man,"$12,000",$0,$0

Conclusion:
- Would ya look at that, this might be the ID we need to link an ID to a title, which could link us to the rest of the data
- We should probably look and see what the difference is between the domestic_gross represented here versus domestic_gross in "bom.movie_gross.csv.gz"
- This data set likely is going to be very valuable in linking together the different csv files